clc;close all;dbclear all
% K:\Matlab\code\mechaincs\launch_vehicle\load
h=4.5e3;%km->m
g=9.81;Re=6371e3;rho_0=1.225;beta=1.3e-4;
u=26.5;V=350;
alpha=atan(u/V);
% gamma=1.4;R=287.05;T0=288.15;lamda_T=6.5;
% h=7.8824e+03
% c=sqrt(gamma*R*(T0-lamda_T*h/1e3));%对流层温度估算公式
% Ma=V/c;%1.0851
Ma= v2Mach(V,h); %1.0849 差别不大
P=2400e3;%KN->N
m=163772.2;%kg<-ton

Stage1=46.28;  Stage3=16.49;%m
block1=17.34;  block2=12.45;
frame=[0 3.27 7.12 8.73 8.98 12.56 14 16.49 18.49 21.29 23.97 28.94 30.02 35.31 37 42.25 46.28];
%fuel=
D=[0 3.2 2.6 3.8 5.6];
%oxidizer=
l01=1.93; l45=1.64; l89=2.64; l1314=2.8;
EF=1e-8*[1 15 10 10 7 7 5.5 5.5 12 12 12 18 20 25 25 25 37];%N
% stairs(qm); 绘制阶梯图
tube_length=[3.2700 3.8500 1.6100+0.2500 3.5800 1.4400 2.4900 2.0000 2.8000 2.6800 4.9700 1.0800    5.2900    1.6900    5.2500    4.0300];
interlevel_segment=[1.86 4.97 4.03];
tube=[3.85 14.99 13.31];
lamba=tube./D(2:4);
l_F=[0 tube_length(1) interlevel_segment];
%% 1.2 计算纵向过载nx以及轴力N
%计算空气阻力
%g=g0*(Re/(Re+h))^2;
rho=rho_0*exp(-beta*h);
q=rho*V^2/2;%无需速度合成
r=0:0.1:Stage1;
X_p=zeros(1,length(D)-1);
F_t=X_p;F_j=X_p;
for i=1:length(D)-1
    tube=[0 3.85 14.99 13.31];%matlab中局部作用域生效在整个区间
    beta1(i)=atan2((D(i+1)-D(i)),l_F(i+1)*2);
    F_t(i)=(D(i)+D(i+1))*l_F(i+1)/2/2;
    F_j(i)=D(i)*tube(i)/2;
    X_p(i)=3/2*(alpha^2+2*beta1(i)^2)*q*(pi*(D(i+1)^2-D(i)^2)/4);%修改角度
    q_axp(i)=-2*pi*beta1(i)*q*(alpha^2+2*beta1(i)^2);
end
tube(tube==0)=[];
X=sum(X_p)*(1+0.2)*(1+0.15);   %2   6   15  25  
nx=(P-X)/m/g;
% ac=@(x)sin(x)./x
% s=quad(ac,pi/4,pi/2)%自适应 Simpson 积分法计算数值积分
%'function_handle' 类型的操作数不支持运算符 '+'。  不支持一元运算符 '-'。
%q_ax=-(sum(X_p)*0.4/sum(F_t+F_j)*r+(@(r)(0<r<l_F(2))*q_axp(1)+(l_F(2)<r<l_F(3))*q_axp(2)+(l_F(3)<r<l_F(4))*q_axp(3)+(l_F(4)<r<l_F(5))*q_axp(4)));
%必须分开算q_axp——因为每一段l、r1、r2不一样
%matlab中索引从1开始
% q_ax=@(x)((x>frame(1)&x<frame(2))*q_axp(1).*x+...
%     (x>frame(3)&x<frame(5))*q_axp(2).*x+...
%     (x>frame(end-6)&x<frame(end-5))*q_axp(3).*x+...
%     (x>frame(end-1)&x<frame(end))*q_axp(4).*x-...
%     sum(X_p)*0.2/sum(F_t+F_j).*x);
% figure(1)
% plot(r,q_ax(r))  %调用句柄
r1=[3.2 3.2 2.6 2.6 3.8 3.8 5.6]/2;%我觉得你需要改
q_axp_0=[q_axp(1) q_axp(2) q_axp(2) q_axp(3) q_axp(3) q_axp(4) q_axp(4)];
q_ax_0=(-sum(X_p)*0.2/sum(F_t+F_j)+q_axp_0).*r1
q_ax_1=-D(2:4)/2*sum(X_p)*0.2/sum(F_t+F_j)
%% 这个地方不对，你可以想想
%plot 函数期望的是向量或矩阵形式的数据作为输入
qm=[0 160 125 100 55 55 100 100 250 250 250 370 400 500 500 500 740];%kg/m
qm=-qm*nx*g
q_m=zeros(length(r),100);
for i=1:2:20
    frame1=[0 3.27 3.27 7.12 7.12 8.73 ...
        8.73  14 ...
        14 18.49 18.49 23.97 23.97 28.94 28.94 35.31 35.31 42.25 ...
        42.25 46.28];
    qm=[0 160 125 125 125 100 ...
        55 55 100 100 250 250 ...
        250 370 400 400 500 500 ...
        500 740];%kg/m
    %无法从 function_handle 转换为 double (不可以将其赋值给矩阵)     
    %refresh 
     q_m1=@(r)(r>=frame1(i)&r<=frame1(i+1)).*(((qm(i+1)-qm(i))/(frame1(i+1)-frame1(i)).*(r-frame1(i)))+qm(i));
     q_m(:,i)=q_m1(r);
end
q_m(q_m==0) = [];
q_m=-q_m*nx*g;
figure(1) 
plot(r,q_m)

tube_length=[3.2700 3.8500 1.6100+0.2500 3.5800 1.4400 2.4900 2.0000 2.8000 2.6800 4.9700 1.0800    5.2900    1.6900    5.2500    4.0300];
qx=[81588-402.5 1304.2-314.4 314.4+2516 251.5+2045 1059.7-138.3 1059.7-251.5 1059.7-628.9 ...
    2478-628.9 3622-930.7   1548.7-1006.2 1548.7-1257.7 12761-1257.7 18806-1861.4]
N=[81186*3.27/2 990*3.85 (2830+2296)*1.86/2 921*(3.58+1.44) 808*(2.49+2) 431*(2.8+2.68) (1849+2691)*4.97/2 542*(1.08+5.29) 291*(1.69+5.25) (11503+16945)*4.03/2]
N=cumsum(N)
%计算集中质量力（不加燃料）
mi=[0 0 2450 40 40 49+150 0 45 40 50+854 0 200 300 200 300+3801];
P_ix=-nx*mi*g;
%计算增压压力(注意正负)
p_0=[.3  .27 .35 .35 .32 .29]*1e3;
D_0=[D(3) D(3) D(3) D(3) D(4) D(4)];
P_0x=pi.*D_0.^2/4.*p_0;
P_1x=[P_0x(1) P_0x(1)-P_0x(2) P_0x(2) ...
    P_0x(3) P_0x(3)-P_0x(4) P_0x(4) ...
    P_0x(5) P_0x(5) P_0x(6) P_0x(6)];
%计算的边缘点，前两个罐子记得加减
%计算燃料压力(圆柱形=圆台+圆球)【需不需要想得更复杂一些】
mT=[979+15016 1412+6597 1459+17512 1288+12865 4988+40209.3 4400+35434.6];
P_Tx=-nx*mT*g;


%% 1.3 计算法向过载ny、角加速度zz，剪力Q和弯矩M
delta=deg2rad(4.8);
Y_j=1.5*alpha^2*q.*lamba.*(pi.*D(2:4).^2/4);
Y_i=zeros(1,length(D)-1);
frame_Y=[3.27 7.12 8.98 23.97 28.94 42.25 46.28];
for i=1:length(D)-1
    Y_i(i)=3*alpha*q*(pi*(D(i+1)^2-D(i)^2)/4);
    c(i)=l_F(i+1)/3*(1+D(i+1)/(D(i+1)+D(i)));
end
Y=sum(Y_j)+sum(Y_i);
ny=(P*delta+Y)/m/g;
% 压心(对最前边取矩)
cz_0=[c(1) frame_Y(1)+tube(1)/2 frame_Y(2)+c(2) frame_Y(3)+tube(2)/2 ...
      frame_Y(4)+c(3) frame_Y(5)+tube(3)/2 frame_Y(6)+c(4)];
%Y_=[Y_i(1) Y_j(1) Y_i(2) Y_j(2) Y_i(3) Y_j(3) Y_i(4)];
Y_=[];%初始化
for i=1:2*length(Y_i)-1
    if mod(i,2) == 0 %偶数 2 4 6 8
        Y_(end+1)=Y_j(i/2);%想法设法让其变小
    else
        Y_(end+1)=Y_i((i+1)/2);
    end
end
cz=(Y_*cz_0')/Y;% 注意逆的位置

%EF刚度
a=cz-29.412;b=Stage1-29.412;Iz=.2041e8;
Mz=Y*a-P*delta*b;
zz=Mz/Iz;


%% 绘制剪力、弯矩
A= [0,3.27, 3.85, 1.61, 0.25, 3.58, 0.3501, 1.09, 2.49, 2.0, 2.8, 0.3502, 2.33, 4.97, 1.08, 2.28, 3.01, 1.69, 2.246, 3.004, 4.03];
A=cumsum(A);
B0 = zeros(2*size(A,2)-1, 1);   
for i = 1:size(A,2)-1
    B0(2*i-1) = A(i); % 将当前元素赋值到B
    B0(2*i) = (A(i) + A(i+1)) / 2; % 计算当前元素与下一个元素的平均值，并赋值
end
B0(end) = A(end); 
Q1= [0, 76.56, 80.19, 75.77, 75.95, 71.25, 71.49, 65.52, 67.08, 68.22, 37.05, 37.14, 5.888, 59.19, 58.45, 57.99, -106, -108.2, -110.5, -113.7];
Q2= [19.15, 78.4, 77.46, 75.86, 74.87, 71.37, 69.36, 66.31, 67.69, 54.9, 37.09, 24.64, 30.17, 59.13, 58.25, -11.88, -106.7, -109.3, -190.0, -62.13];
Q3= [76.56, 80.19, 74.99, 75.95, 71.96, 71.49, 66.98, 67.08, 68.28, 39.86, 37.14, 11.09, 59.19, 59.06, 57.99, -85.97, -107.4, -110.5, -273.3, -0.00001943];

M1= [0.0, -83.47, -385.3, -512.8, -531.8, -798.8, -823.8, -899.8, -981.9, -1065.0, -1354.0, -1367.0, -1430.0, -1584.0, -1647.0, -1780.0, -1746.0, -1566.0, -1321.0, -243.3];
M2 = [-10.44, -232.6, -448.7, -522.3, -667.0, -811.3, -862.2, -981.9, -1132.0, -1287.0, -1360.0, -1403.0, -1474.0, -1616.0, -1714.0, -1816.0, -1657.0, -1444.0, -1095.0, -64.36];
M3 = [-83.47, -385.3, -510.1, -531.8, -798.7, -823.8, -899.4, -1065.0, -1200.0, -1353.0, -1367.0, -1424.0, -1584.0, -1647.0, -1780.0, -1742.0, -1566.0, -1321.0, -747.9, -0.0005365];
Q = "Q";%字符串初始化
M = "M";
fig1=QM_plot(B0,Q1,Q2,Q3,Q);
fig2=QM_plot(B0,M1,M2,M3,M);

%% 2.1 桁架模型图



%% 2.2 qt、M、Q



%% 2.3 确定桁架横截面


%% 2.4 桁架表面计算



%% 3.1.1 罐体参数


%% 3.1.2 罐体应力




%% 3.2 罐体稳定性



%% 4.1 非密封隔间模型图


%% 4.2 非密封隔间参数



%% 4.3 计算危险截面法向和切向应力



%% 4.4 许用应力计算


%% 4.5 确定负载最重的受力元件（钢绞线、钢梁、蒙皮板、铆钉）的安全系数






















